let q1 = prompt("Любая лчиность (в именительном падеже)", "Джейсон Стетхем");
let q2 = prompt("Любой праздник (в винительном падеже)", "1 сентября");
let q3 = prompt("Любой подарок (в винительном падеже)", "банку огурцов");
let q4 = prompt("За что вы получаете подарок", "был хорошим мальчиком");
let q5 = prompt("От кого (в родительном падеже)", "Джека Воробья");
alert("Дорогой " + q1 + ". Я желаю, чтобы ты принёс мне подарок на " + q2 + ". Я бы очень хотел получить " + q3 + " за то, что я " + q4 + ". Очень жду, что ты придёшь. От " + q5 + ".")