// let otvet = ['C', 'B', 'B', 'A', 'D', 'C', 'B', 'C', 'A', 'B'];

// let money = ['1000', '4000', '8000', '16000', '32000', '64000', '125000', '250000', '500000', '1000000'];

// let answer1 = prompt("Кто был первым военным министром Российской Империи?\n\nA:Аракчеев\nB:Барклай-де-Толли\nC:Вязмитинов\nD:Коновницын");

// if (answer1 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer2 = prompt("Персонаж игры Dota 2, котрый управляет илюзиями?\n\nA:Shadow Fiend\nB:Arc Warden\nC:Shadow Shaman\nD:Magnus");

// if (answer2 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer3 = prompt("Победитель 'The international 2022'?\n\nA:Team Secret\nB:Tundra Esrorts\nC:Team Spirit\nD:PSG.LGD");

// if (answer3 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer4 = prompt("Реки  с каким названием нет на территроии России?\n\nA:Спина\nB:Уста\nC:Палец\nD:Шея");

// if (answer4 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer5 = prompt("Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?\n\nA:Опьянение\nB:Любовь\nC:Уединение\nD:Сон");

// if (answer5 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer6 = prompt("Кого назвали безоговорочно лучшим игроком СНГ в игре CS:GO?\n\nA:electronic\nB:b1t\nC:s1mple\nD:dev1ce");

// if (answer6 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer7 = prompt("Кто из этих философов в 1864 году написал музыку на стихи А. С. Пушкина «Заклинание» и «Зимний вечер»?\n\nA:Юнг\nB:Ницше\nC:Шопенгауэр\nD:Гегель");

// if (answer7 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer8 = prompt("С какой фигуры начинаются соревнования по городошному спорту?\n\nA:Часовые\nB:Артиллерия\nC:Пушка\nD:Пулемётное гнездо");

// if (answer8 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer9 = prompt("Что Иван Ефремов в романе «Лезвие бритвы» назвал наивысшей степенью целесообразности?\n\nA:Красоту\nB:Мудрость\nC:Смерть\nD:Свободу");

// if (answer9 == otvet[i]) {
//     alert("Поздравляем, вы выиграли " + money[i] + " евро.")
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

// let answer10 = prompt("Сколько раз в сутки подзаводят куранты Спасской башни Кремля?\n\nA:Один\nB:Два\nC:Три\nD:Четыре");

// if (answer10 == otvet[i]) {
//     alert("Ура!\nВы победили))\nТеперь Вы миллионер");
// }
// else {
//     alert("Конец игры!\nВы проиграли((");
// }

let otvet = ['C', 'B', 'B', 'A', 'D', 'C', 'B', 'C', 'A', 'B'];

let money = ['1000', '4000', '8000', '16000', '32000', '64000', '125000', '250000', '500000', '1000000'];

let answer = ['Кто был первым военным министром Российской Империи?\n\nA:Аракчеев\nB:Барклай-де-Толли\nC:Вязмитинов\nD:Коновницын','Персонаж игры Dota 2, котрый управляет илюзиями?\n\nA:Shadow Fiend\nB:Arc Warden\nC:Shadow Shaman\nD:Magnus','Победитель The international 2022?\n\nA:Team Secret\nB:Tundra Esrorts\nC:Team Spirit\nD:PSG.LGD','Реки  с каким названием нет на территроии России?\n\nA:Спина\nB:Уста\nC:Палец\nD:Шея','Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?\n\nA:Опьянение\nB:Любовь\nC:Уединение\nD:Сон','Кого назвали безоговорочно лучшим игроком СНГ в игре CS:GO?\n\nA:electronic\nB:b1t\nC:s1mple\nD:dev1ce','Кто из этих философов в 1864 году написал музыку на стихи А. С. Пушкина «Заклинание» и «Зимний вечер»?\n\nA:Юнг\nB:Ницше\nC:Шопенгауэр\nD:Гегель','С какой фигуры начинаются соревнования по городошному спорту?\n\nA:Часовые\nB:Артиллерия\nC:Пушка\nD:Пулемётное гнезд','Что Иван Ефремов в романе «Лезвие бритвы» назвал наивысшей степенью целесообразности?\n\nA:Красоту\nB:Мудрость\nC:Смерть\nD:Свободу','Сколько раз в сутки подзаводят куранты Спасской башни Кремля?\n\nA:Один\nB:Два\nC:Три\nD:Четыре'];

for(let i = 0;i<10;i++){
    let k = prompt(answer[i]);
    if(k==otvet[i]){
        alert("Поздравляем, вы выиграли " + money[i] + " евро.")
    }
    else{
        alert("Конец игры!\nВы проиграли((");
        break;
    }
}

// for (let i = 0; i <= 10; i++) {
//     let answer1 = prompt("Кто был первым военным министром Российской Империи?\n\nA:Аракчеев\nB:Барклай-де-Толли\nC:Вязмитинов\nD:Коновницын");

//     if (answer1 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer2 = prompt("Персонаж игры Dota 2, котрый управляет илюзиями?\n\nA:Shadow Fiend\nB:Arc Warden\nC:Shadow Shaman\nD:Magnus");

//     if (answer2 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer3 = prompt("Победитель The international 2022?\n\nA:Team Secret\nB:Tundra Esrorts\nC:Team Spirit\nD:PSG.LGD");

//     if (answer3 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer4 = prompt("Реки  с каким названием нет на территроии России?\n\nA:Спина\nB:Уста\nC:Палец\nD:Шея");

//     if (answer4 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer5 = prompt("Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?\n\nA:Опьянение\nB:Любовь\nC:Уединение\nD:Сон");

//     if (answer5 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer6 = prompt("Кого назвали безоговорочно лучшим игроком СНГ в игре CS:GO?\n\nA:electronic\nB:b1t\nC:s1mple\nD:dev1ce");

//     if (answer6 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer7 = prompt("Кто из этих философов в 1864 году написал музыку на стихи А. С. Пушкина «Заклинание» и «Зимний вечер»?\n\nA:Юнг\nB:Ницше\nC:Шопенгауэр\nD:Гегель");

//     if (answer7 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer8 = prompt("С какой фигуры начинаются соревнования по городошному спорту?\n\nA:Часовые\nB:Артиллерия\nC:Пушка\nD:Пулемётное гнездо");

//     if (answer8 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer9 = prompt("Что Иван Ефремов в романе «Лезвие бритвы» назвал наивысшей степенью целесообразности?\n\nA:Красоту\nB:Мудрость\nC:Смерть\nD:Свободу");

//     if (answer9 == otvet[i]) {
//         alert("Поздравляем, вы выиграли " + money[i] + " евро.")
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//         break;
//     }

//     let answer10 = prompt("Сколько раз в сутки подзаводят куранты Спасской башни Кремля?\n\nA:Один\nB:Два\nC:Три\nD:Четыре");

//     if (answer10 == otvet[i]) {
//         alert("Ура!\nВы победили))\nТеперь Вы миллионер");
//     }
//     else {
//         alert("Конец игры!\nВы проиграли((");
//     }
// }